app/controllers/spends_controller.rb

  def index
    @spends = Spend.all(:order => 'amount DESC')
---
SELECT * FROM `spends` ORDER BY amount DESC

  def show
    @spend = Spend.find(params[:id])
---
SELECT * FROM `spends` WHERE (`spends`.`id` = 0)

  def import_data
    spend_xml = File.read('public/supplierspend2010Q2.xml')
    spend_hash = Hash.from_xml(spend_xml)
    logger.info("--- spend_hash: #{spend_hash['supplier_spend']['periods']}")
    start = spend_hash['supplier_spend']['periods']['period']['start']
    end_date = spend_hash['supplier_spend']['periods']['period']['end']
    spend_hash['supplier_spend']['periods']['period']['record'].each do |tree|
      @spend = Spend.new()
      @spend.ref = tree['ref']
      @spend.supplier = tree['supplier']
      @spend.amount = tree['amount']
      @spend.start_date = start
      @spend.end_date = end_date
      @spend.save!
---
INSERT INTO `spends` (`start_date`, `created_at`, `supplier`, `updated_at`, `amount`, `ref`, `end_date`) VALUES('2010-04-01', '2010-08-16 20:56:07', '2E2 UK LTD', '2010-08-16 20:56:07', 2293.0, '103643', '2010-06-30')